# 关闭原来表中的主外键约束功能
set FOREIGN_KEY_CHECKS=0;
# 清空原有的课程分类表信息
# truncate table ly_course_category;
# 添加课程分类信息
# insert into ly_course_category (name,orders,is_show,is_delete,created_time,updated_time) VALUES
# ("python",1,1,0,"2019-11-11 12:00:00","2019-11-11 12:00:00"),
# ("python进阶",2,1,0,"2019-11-11 12:00:00","2019-11-11 12:00:00"),
# ("java",3,1,0,"2019-11-11 12:00:00","2019-11-11 12:00:00"),
# ("前端开发",4,1,0,"2019-11-11 12:00:00","2019-11-11 12:00:00");

# 添加老师
# truncate table `ly_teacher`;
# INSERT INTO `ly_teacher`
# (`is_show`, `orders`, `is_delete`, `created_time`, `updated_time`, `name`, `role`, `title`, `signature`, `image`, `brief`)
# VALUES
# (1, 1, 0, '2019-12-24 03:38:26.301890', "2019-12-24 03:38:26.301890", 'Alex', 0, '架构师', '流行网红', 'teacher/member_mSPj85s.png', 'xxx'),
# (1, 2, 0, '2019-12-24 03:38:26.301890', '2019-12-24 03:38:26.301890', '佩奇', 0, '总监', '当红花旦', 'teacher/member_mSPj85s.png', 'xxx');

# 添加课程信息
truncate table `ly_course`;
INSERT INTO `luffy`.`ly_course`
(`is_show`, `orders`, `is_delete`, `create_time`, `update_time`, `name`, `course_img`, `course_video`, `course_type`, `brief`, `level`, `pub_date`, `period`, `attachment_path`, `status`, `students`, `lessons`, `pub_lessons`, `price`, `course_category_id`, `teacher_id`)
VALUES
(1, 1, 0, '2019-12-24 03:39:12.397806', '2019-12-24 03:39:12.397806', 'python3天入门', 'course/course-cover.jpeg', '', 0, 'xxx', 0, '2019-12-24', 7, '', 0, 99, 100, 80, 1000.00, 1, 1),
(1, 1, 0, '2019-12-24 03:39:12.397806', '2019-12-24 03:39:12.397806', 'python7天入门', 'course/course-cover.jpeg', '', 0, 'xxx', 0, '2019-12-24', 7, '', 0, 99, 100, 80, 1000.00, 1, 1),
(1, 1, 0, '2019-12-24 03:39:12.397806', '2019-12-24 03:39:12.397806', 'Linux快速入门', 'course/course-cover.jpeg', '', 0, 'xxx', 0, '2019-12-24', 7, '', 0, 99, 100, 80, 1000.00, 1, 1),
(1, 1, 0, '2019-12-24 03:39:12.397806', '2019-12-24 03:39:12.397806', 'Go语言开发', 'course/course-cover.jpeg', '', 0, 'xxx', 0, '2019-12-24', 7, '', 0, 99, 100, 80, 1000.00, 1, 1),
(1, 1, 0, '2019-12-24 03:39:12.397806', '2019-12-24 03:39:12.397806', 'Java10天入门', 'course/course-cover.jpeg', '', 0, 'xxx', 0, '2019-12-24', 7, '', 0, 99, 100, 80, 1000.00, 1, 1),
(1, 1, 0, '2019-12-24 03:39:12.397806', '2019-12-24 03:39:12.397806', 'java web 开发', 'course/course-cover.jpeg', '', 0, 'xxx', 0, '2019-12-24', 7, '', 0, 99, 100, 80, 1000.00, 1, 1),
(1, 1, 0, '2019-12-24 03:39:12.397806', '2019-12-24 03:39:12.397806', 'Linux浸入式开发', 'course/course-cover.jpeg', '', 0, 'xxx', 0, '2019-12-24', 7, '', 0, 99, 100, 80, 1000.00, 1, 1),
(1, 1, 0, '2019-12-24 03:39:12.397806', '2019-12-24 03:39:12.397806', 'Linux集群架构', 'course/course-cover.jpeg', '', 0, 'xxx', 0, '2019-12-24', 7, '', 0, 99, 100, 80, 1000.00, 1, 1),
(1, 1, 0, '2019-12-24 03:39:12.397806', '2019-12-24 03:39:12.397806', 'django框架', 'course/course-cover.jpeg', '', 0, 'xxx', 0, '2019-12-24', 7, '', 0, 99, 100, 80, 1000.00, 1, 1),
(1, 1, 0, '2019-12-24 03:39:12.397806', '2019-12-24 03:39:12.397806', 'django实战', 'course/course-cover.jpeg', '', 0, 'xxx', 0, '2019-12-24', 7, '', 0, 99, 100, 80, 1000.00, 1, 1),
(1, 1, 0, '2019-12-24 03:39:12.397806', '2019-12-24 03:39:12.397806', 'Java进阶开发', 'course/course-cover.jpeg', '', 0, 'xxx', 0, '2019-12-24', 7, '', 0, 99, 100, 80, 1000.00, 1, 1),
(1, 1, 0, '2019-12-24 03:39:12.397806', '2019-12-24 03:39:12.397806', 'SSH框架', 'course/course-cover.jpeg', '', 0, 'xxx', 0, '2019-12-24', 7, '', 0, 99, 100, 80, 1000.00, 1, 1),
(1, 1, 0, '2019-12-24 03:39:12.397806', '2019-12-24 03:39:12.397806', 'Vue项目开发', 'course/course-cover.jpeg', '', 0, 'xxx', 0, '2019-12-24', 7, '', 0, 99, 100, 80, 1000.00, 1, 1),
(1, 1, 0, '2019-12-24 03:39:12.397806', '2019-12-24 03:39:12.397806', 'javascript精讲', 'course/course-cover.jpeg', '', 0, 'xxx', 0, '2019-12-24', 7, '', 0, 99, 100, 80, 1000.00, 1, 1);

# 添加课程章节
truncate table `ly_course_chapter`;
INSERT INTO `ly_course_chapter` (`is_show`, `orders`, `is_delete`, `create_time`, `update_time`, `chapter`, `name`, `summary`, `pub_date`, `course_id`)
VALUES
(1, 1, 0, '2019-12-24 03:39:27.431447', '2019-12-24 03:39:27.431447', 1, 'python快速入门', 'ssss', '2019-12-24', 1),
(1, 2, 0, '2019-12-24 03:39:27.431447', '2019-12-24 03:39:27.431447', 1, 'python函数', 'ssss', '2019-12-24', 1),
(1, 3, 0, '2019-12-24 03:39:27.431447', '2019-12-24 03:39:27.431447', 1, 'python面向对象', 'ssss', '2019-12-24', 1),
(1, 4, 0, '2019-12-24 03:39:27.431447', '2019-12-24 03:39:27.431447', 1, 'python模块', 'ssss', '2019-12-24', 1),
(1, 5, 0, '2019-12-24 03:39:27.431447', '2019-12-24 03:39:27.431447', 1, 'python网络编程', 'ssss', '2019-12-24', 1);

# 添加课程课时
truncate table `ly_course_lesson`;
INSERT INTO `ly_course_lesson`
(`is_show`, `orders`, `is_delete`, `create_time`, `update_time`, `name`, `lesson_type`, `lesson_link`, `duration`, `pub_date`, `free_trail`, `recomment`, `chapter_id`, `course_id`)
VALUES
(1, 1, 0, '2019-12-24 03:40:00.711232', '2019-12-24 03:40:00.711232', 'python历史版本介绍', 2, null, '3:30', '2019-12-24 03:40:00.711232', 1, 1, 1, 1),
(1, 2, 0, '2019-12-24 03:40:00.711232', '2019-12-24 03:40:00.711232', 'python虚拟环境', 2, null, '3:30', '2019-12-24 03:40:00.711232', 1, 1, 1, 1),
(1, 3, 0, '2019-12-24 03:40:00.711232', '2019-12-24 03:40:00.711232', 'python环境安装', 2, null, '3:30', '2019-12-24 03:40:00.711232', 1, 1, 1, 1),
(1, 4, 0, '2019-12-24 03:40:00.711232', '2019-12-24 03:40:00.711232', 'python第一个脚本', 2, null, '3:30', '2019-12-24 03:40:00.711232', 1, 1, 1, 1),
(1, 5, 0, '2019-12-24 03:40:00.711232', '2019-12-24 03:40:00.711232', '变量', 2, null, '3:30', '2019-12-24 03:40:00.711232', 1, 1, 1, 1);

# 开启原来表中的主外键约束功能
set FOREIGN_KEY_CHECKS=1;